Revit 2027 API
DockablePaneId Constructor
Creates a new DockablePaneId instance.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DockablePaneId(
	Guid guid
)
Public Sub New (
	guid As Guid
)
public:
DockablePaneId(
	Guid guid
)
new :
        guid : Guid -> DockablePaneId
Parameters
guid Guid
The identifier for the DockablePaneId.
See Also
Reference
DockablePaneId Class
Autodesk.Revit.UI Namespace